app/Controllers/Note.php

SELECT *
FROM `tbl_note`
---
    public function list_notes()
    {
        $notemodel = new NoteModel();
        $res = $notemodel->findAll();

UPDATE `tbl_note` SET `title` = 'Berhasil Yagesya', `content` = 'Sipa', `updated_at` = '2022-07-27 00:25:14'
WHERE `tbl_note`.`id` IN ('17')
---
                    'title' => $this->request->getVar()->title,
                    'content' => $this->request->getVar()->content
                ];
                $notemodel->update($this->request->getVar()->id, $data);